GregSiGenix/MovingFwdVSCode/emFile/Driver/MMC_CM/Morpheus/FS_MMC_HW_CM_STM32H735_Morpheus.c
/*********************************************************************
*                   (c) SEGGER Microcontroller GmbH                  *
*                        The Embedded Experts                        *
*                           www.segger.com                           *
**********************************************************************

----------------------------------------------------------------------
Licensing information

Licensor:                 SEGGER Microcontroller Systems LLC
Licensed to:              React Health Inc., 203 Avenue A NW, Suite 300, Winter Haven FL 33881, USA
Licensed SEGGER software: emFile
License number:           FS-00855
License model:            SSL [Single Developer Single Platform Source Code License]
Licensed product:         -
Licensed platform:        STM32F4, IAR
Licensed number of seats: 1
-------------------------- END-OF-HEADER -----------------------------

File    : FS_MMC_HW_CM_STM32H735_Morpheus.c
Purpose : Hardware layer for MMC/SD driver in CardMode, for the React Health Morpheus board.
Literature:
  [1] SD Specifications Part 1 Physical Layer Simplified Specification Version 2.00
    (\\fileserver\Techinfo\Company\SDCard_org\SDCardPhysicalLayerSpec_V200.pdf)
  [2] RM0468 Reference manual STM32H723/733, STM32H725/735 and STM32H730 Value line advanced Arm-based 32-bit MCUs
    (\\fileserver\Techinfo\Company\ST\MCU\STM32\STM32H7\rm0468-stm32h723733-stm32h725735-and-stm32h730-value-line-advanced-armbased-32bit-mcus-stmicroelectronics.pdf)
  [3] Datasheet STM32H735xG
    (\\fileserver\Techinfo\Company\ST\MCU\STM32\STM32H7\DS13312_STM32H735xx_rev2.pdf)
  [4] UM2679 User manual Discovery kit with STM32H735IG MCU
    (\\fileserver\Techinfo\Company\ST\MCU\STM32\STM32H7\EvalBoard\STM32H735G_DISCO_UM.pdf)
  [5] Schematics STM32H735IG-DK
    (\\fileserver\Techinfo\Company\ST\MCU\STM32\STM32H7\EvalBoard\STM32H735G_DISCO_Schematics.pdf)
  [6] STM32H723xx STM32H730xx STM32H733xx STM32H725xx STM32H735xx Errata sheet
    (\\fileserver\Techinfo\Company\ST\MCU\STM32\STM32H7\ES0491_rev7_STM32H72xx_73xx.pdf)
*/

/*********************************************************************
*
*       #include section
*
**********************************************************************
*/
#include "FS.h"
#include "stm32h7xx_hal.h"
#include "main.h" //for SDIO1_CD pin defines

/*********************************************************************
*
*       Defines, configurable
*
**********************************************************************
*/
#ifndef   FS_MMC_HW_CM_SDMMC_CLK
  #define FS_MMC_HW_CM_SDMMC_CLK            200000        // Clock frequency of SDMMC module (in kHz)
#endif

#ifndef   FS_MMC_HW_CM_MAX_SD_CLK                         // KDS-TODO increase this to 50000 for new board
  #define FS_MMC_HW_CM_MAX_SD_CLK           50000         // Maximum clock frequency supplied to SD card (in kHz)
#endif

#ifndef   FS_MMC_HW_CM_POWER_GOOD_DELAY
  #define FS_MMC_HW_CM_POWER_GOOD_DELAY     50            // Number of  milliseconds to wait for the power supply of SD card to become ready
#endif

#ifndef   FS_MMC_HW_CM_CPU_CLK
  #define FS_MMC_HW_CM_CPU_CLK              400000000     // CPU clock frequency
#endif

#ifndef   FS_MMC_HW_CM_AHB_CLK
  #define FS_MMC_HW_CM_AHB_CLK              (FS_MMC_HW_CM_CPU_CLK / 2)   // Frequency of the AHB clock supplied to SDMMC peripheral (in Hz)
#endif

#ifndef   FS_MMC_HW_CM_CYCLES_PER_1MS
  #define FS_MMC_HW_CM_CYCLES_PER_1MS       400000        // Number of software cycles required to generate a 1ms delay
#endif

#ifndef   FS_MMC_HW_CM_USE_OS
  #define FS_MMC_HW_CM_USE_OS               1             // Enables or disables the event-driven operation.
                                                          // Permitted values:
                                                          //   0 - polling via CPU
                                                          //   1 - event-driven using embOS
                                                          //   2 - event-driven using other RTOS
#endif

/*********************************************************************
*
*       #include section, conditional
*
**********************************************************************
*/
#if FS_MMC_HW_CM_USE_OS
  #include "stm32h7xx.h"
  #include "FS_OS.h"
#if (FS_MMC_HW_CM_USE_OS == 1)
  #include "RTOS.h"
#endif // FS_MMC_HW_CM_USE_OS == 1
#endif // FS_MMC_HW_CM_USE_OS

/*********************************************************************
*
*       Defines, non-configurable
*
**********************************************************************
*/

/*********************************************************************
*
*       SDMMC interface registers
*/
#define SDMMC_BASE_ADDR              0x52007000uL
#define SDMMC_POWER                  (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x00))
#define SDMMC_CLKCR                  (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x04))
#define SDMMC_ARGR                   (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x08))
#define SDMMC_CMDR                   (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x0C))
#define SDMMC_RESPCMDR               (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x10))
#define SDMMC_RESP1R                 (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x14))
#define SDMMC_RESP2R                 (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x18))
#define SDMMC_RESP3R                 (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x1C))
#define SDMMC_RESP4R                 (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x20))
#define SDMMC_DTIMER                 (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x24))
#define SDMMC_DLENR                  (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x28))
#define SDMMC_DCTRLR                 (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x2C))
#define SDMMC_DCNTR                  (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x30))
#define SDMMC_STAR                   (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x34))
#define SDMMC_ICR                    (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x38))
#define SDMMC_MASKR                  (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x3C))
#define SDMMC_ACKTIMER               (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x40))
#define SDMMC_IDMACTRLR              (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x50))
#define SDMMC_IDMABSIZER             (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x54))
#define SDMMC_IDMABASE0R             (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x58))
#define SDMMC_IDMABASE1R             (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x5C))
#define SDMMC_FIFOR                  (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x80))

/*********************************************************************
*
*       Reset and clock control registers
*/
#define RCC_BASE_ADDR                 0x58024400uL
#define RCC_D1CCIPR                   (*(volatile U32 *)(RCC_BASE_ADDR + 0x04C))
#define RCC_AHB3RSTR                  (*(volatile U32 *)(RCC_BASE_ADDR + 0x07C))

/*********************************************************************
*
*       Reset and clock bits for the peripherals used by the driver
*/
#define AHB4ENR_GPIOCEN_BIT           2
#define AHB4ENR_GPIODEN_BIT           3
#define AHB4ENR_GPIOFEN_BIT           5
#define AHB3ENR_SDMMC1EN_BIT          16
#define AHB3RSTR_SDMMC1RST_BIT        16

/*********************************************************************
*
*       SDMMC status register
*/
#define STAR_CCRCFAIL_BIT             0
#define STAR_DCRCFAIL_BIT             1
#define STAR_CTIMEOUT_BIT             2
#define STAR_DTIMEOUT_BIT             3
#define STAR_TXUNDERR_BIT             4
#define STAR_RXOVERR_BIT              5
#define STAR_CMDREND_BIT              6
#define STAR_CMDSENT_BIT              7
#define STAR_DATAEND_BIT              8
#define STAR_DPSMACT_BIT              12
#define STAR_CPSMACT_BIT              13
#define STAR_TXFIFOHE_BIT             14
#define STAR_RXFIFOHF_BIT             15
#define STAR_TXFIFOF_BIT              16
#define STAR_RXFIFOF_BIT              17
#define STAR_TXFIFOE_BIT              18
#define STAR_RXFIFOE_BIT              19
#define STAR_BUSYD0_BIT               20
#define STAR_BUSY0END_BIT             21

/*********************************************************************
*
*       SDMMC data control register
*/
#define DCTRLR_DTEN_BIT               0
#define DCTRLR_DTDIR_BIT              1
#define DCTRLR_DBLOCKSIZE_BIT         4uL

/*********************************************************************
*
*       SDMMC clock control register
*/
#define CLKCR_CLKDIV_BIT              0
#define CLKCR_CLKDIV_MASK             0x3FFuL
#define CLKCR_CLKDIV_MAX              CLKCR_CLKDIV_MASK
#define CLKCR_PWRSAV_BIT              12
#define CLKCR_WIDBUS_MASK             3uL
#define CLKCR_WIDBUS_4BIT             1uL
#define CLKCR_WIDBUS_8BIT             2uL
#define CLKCR_WIDBUS_BIT              14
#define CLKCR_HWFC_EN_BIT             17

/*********************************************************************
*
*       SDMMC command register
*/
#define CMDR_CMDINDEX_MASK            0x3FuL
#define CMDR_CMDINDEX_BIT             0
#define CMDR_CMDTRANS_BIT             6
#define CMDR_WAITRESP_SHORT           1uL
#define CMDR_WAITRESP_SHORT_NO_CRC    2uL
#define CMDR_WAITRESP_LONG            3uL
#define CMDR_WAITRESP_BIT             8uL
#define CMDR_CPSMEN_BIT               12

/*********************************************************************
*
*       SDMMC interrupt control register
*/
#define ICR_CCRCFAILC_BIT             0
#define ICR_DCRCFAILC_BIT             1
#define ICR_CTIMEOUTC_BIT             2
#define ICR_DTIMEOUTC_BIT             3
#define ICR_TXUNDERRC_BIT             4
#define ICR_RXOVERRC_BIT              5
#define ICR_CMDRENDC_BIT              6
#define ICR_CMDSENTC_BIT              7
#define ICR_DATAENDC_BIT              8
#define ICR_DBCKENDC_BIT              10
#define ICR_ABORTC_BIT                11
#define ICR_BUSY0ENDC_BIT             21
#define ICR_MASK_STATIC               ((1uL << ICR_CCRCFAILC_BIT) | \
                                       (1uL << ICR_DCRCFAILC_BIT) | \
                                       (1uL << ICR_CTIMEOUTC_BIT) | \
                                       (1uL << ICR_DTIMEOUTC_BIT) | \
                                       (1uL << ICR_TXUNDERRC_BIT) | \
                                       (1uL << ICR_RXOVERRC_BIT)  | \
                                       (1uL << ICR_CMDRENDC_BIT)  | \
                                       (1uL << ICR_CMDSENTC_BIT)  | \
                                       (1uL << ICR_DATAENDC_BIT)  | \
                                       (1uL << ICR_DBCKENDC_BIT)  | \
                                       (1uL << ICR_ABORTC_BIT)    | \
                                       (1uL << ICR_BUSY0ENDC_BIT))

/*********************************************************************
*
*       SDMMC interrupt mask register
*/
#define MASK_CCRCFAILIE_BIT           0
#define MASK_DCRCFAILIE_BIT           1
#define MASK_CTIMEOUTIE_BIT           2
#define MASK_DTIMEOUTIE_BIT           3
#define MASK_TXUNDERRIE_BIT           4
#define MASK_RXOVERRIE_BIT            5
#define MASK_CMDRENDIE_BIT            6
#define MASK_CMDSENTIE_BIT            7
#define MASK_DATAENDIE_BIT            8
#define MASK_DBCKENDIE_BIT            10
#define MASK_TXFIFOHEIE_BIT           14
#define MASK_RXFIFOHFIE_BIT           15
#define MASK_TXFIFOFIE_BIT            16
#define MASK_RXFIFOFIE_BIT            17
#define MASK_TXFIFOEIE_BIT            18
#define MASK_RXFIFOEIE_BIT            19
#define MASK_BUSY0IE_BIT              20
#define MASK_BUSY0ENDIE_BIT           21
#define MASK_ALL                      ((1uL << MASK_CCRCFAILIE_BIT)  | \
                                       (1uL << MASK_DCRCFAILIE_BIT)  | \
                                       (1uL << MASK_CTIMEOUTIE_BIT)  | \
                                       (1uL << MASK_DTIMEOUTIE_BIT)  | \
                                       (1uL << MASK_TXUNDERRIE_BIT)  | \
                                       (1uL << MASK_RXOVERRIE_BIT)   | \
                                       (1uL << MASK_CMDRENDIE_BIT)   | \
                                       (1uL << MASK_CMDSENTIE_BIT)   | \
                                       (1uL << MASK_DATAENDIE_BIT)   | \
                                       (1uL << MASK_DBCKENDIE_BIT)   | \
                                       (1uL << MASK_RXFIFOHFIE_BIT)  | \
                                       (1uL << MASK_TXFIFOFIE_BIT)   | \
                                       (1uL << MASK_RXFIFOFIE_BIT)   | \
                                       (1uL << MASK_RXFIFOEIE_BIT)   | \
                                       (1uL << MASK_BUSY0ENDIE_BIT))

/*********************************************************************
*
*       SDMMC data length register
*/
#define DLENR_DATALENGTH_MASK         0x01FFFFFFuL

/*********************************************************************
*
*       Misc. defines
*/
#define POWER_ON                      3uL
#define MAX_NUM_BLOCKS                65535
#define FIFO_SIZE                     (16 * 4)
#define WAIT_TIMEOUT                  1000      // Maximum number of milliseconds to wait for an operation to finish.
#define WAIT_TIMEOUT_CYCLES           (WAIT_TIMEOUT * FS_MMC_HW_CM_CYCLES_PER_1MS)
#define SDMMC_PRIO                    15
#define D1CCIPR_SDMMCSEL_BIT          16

/*********************************************************************
*
*       Static data
*
**********************************************************************
*/
static U16              _BlockSize;
static U16              _NumBlocks;
static void           * _pBuffer;
static U32              _NumLoopsWriteRegDelay;
static U8               _RepeatSame;
static U8               _IsR1Busy;
#if FS_MMC_HW_CM_USE_OS
  static volatile U32   _StatusSDMMC;
  static U8             _IsIntEnabled;
#endif // FS_MMC_HW_CM_USE_OS

/*********************************************************************
*
*       Static code
*
**********************************************************************
*/

/*********************************************************************
*
*       _ld
*/
static U16 _ld(U32 Value) {
  U16 i;

  for (i = 0; i < 16; i++) {
    if ((1uL << i) == Value) {
      break;
    }
  }
  return i;
}

/*********************************************************************
*
*       _Delay1ms
*
*  Function description
*    Blocks the program execution for about 1ms.
*
*  Additional information
*    The number of loops has to be adjusted according to the CPU speed.
*/
static void _Delay1ms(void) {
#if FS_MMC_HW_CM_USE_OS
  FS_X_OS_Delay(1);
#else
  volatile unsigned NumLoops;

  NumLoops = FS_MMC_HW_CM_CYCLES_PER_1MS;
  do {
    ;
  } while(--NumLoops);
#endif // FS_MMC_HW_CM_USE_OS
}

/*********************************************************************
*
*       _GetStatus
*/
static U32 _GetStatus(void) {
  U32 Status;

#if FS_MMC_HW_CM_USE_OS
  if (_IsIntEnabled) {
    Status = _StatusSDMMC;
  } else
#endif // FS_MMC_HW_CM_USE_OS
  {
    Status = SDMMC_STAR;
  }
  return Status;
}

/*********************************************************************
*
*       _WaitForEventIfRequired
*/
static int _WaitForEventIfRequired(void) {
  int r;

  r = 0;
#if FS_MMC_HW_CM_USE_OS
  if (_IsIntEnabled) {
    r = FS_X_OS_Wait(WAIT_TIMEOUT);
  }
#endif // FS_MMC_HW_CM_USE_OS
  return r;
}

#if FS_MMC_HW_CM_USE_OS

/*********************************************************************
*
*       _EnableInt
*/
static void _EnableInt(void) {
  if (_IsIntEnabled == 0) {
    NVIC_SetPriority(SDMMC1_IRQn, SDMMC_PRIO);
    NVIC_EnableIRQ(SDMMC1_IRQn);
    _IsIntEnabled = 1;
  }
}

/*********************************************************************
*
*       _DisableInt
*/
static void _DisableInt(void) {
  if (_IsIntEnabled != 0) {
    NVIC_DisableIRQ(SDMMC1_IRQn);
    _IsIntEnabled = 0;
  }
}

#endif // FS_MMC_HW_CM_USE_OS

/*********************************************************************
*
*       _WriteRegDelayed
*
*  Function description
*    Waits before writing to a register as specified in the datasheet:
*    "At least seven sdmmc_hclk clock periods are needed between two write accesses to this register."
*/
static void _WriteRegDelayed(volatile U32 * pAddr, U32 Value) {
  volatile U32 NumLoops;

  NumLoops = _NumLoopsWriteRegDelay;
  if (NumLoops) {
    do {
      ;
    } while (--NumLoops);
    *pAddr = Value;
  }
}

/*********************************************************************
*
*       _Reset
*/
static void _Reset(void) {
  U32 clkcr;
  U32 dtimer;

#if FS_MMC_HW_CM_USE_OS
  _DisableInt();
  _StatusSDMMC = 0;
#endif
  //
  // Save register values that have to be restored later.
  //
  clkcr  = SDMMC_CLKCR;
  dtimer = SDMMC_DTIMER;
  //
  // Reset SDMMC peripheral.
  //
  RCC_AHB3RSTR |=   1uL << AHB3RSTR_SDMMC1RST_BIT;
  RCC_AHB3RSTR &= ~(1uL << AHB3RSTR_SDMMC1RST_BIT);
  //
  // Initialize the SDMMC unit.
  //
  SDMMC_POWER  = 0;                           // Switch off the power to SD card.
  SDMMC_CLKCR  = 1uL << CLKCR_PWRSAV_BIT;     // Disable the clock to SD card.
  SDMMC_ARGR   = 0;
  SDMMC_CMDR   = 0;
  SDMMC_DTIMER = 0;
  SDMMC_DLENR  = 0;
  SDMMC_DCTRLR = 0;
  SDMMC_ICR    = 0xFFFFFFFF;                  // Clear all interrupts
  SDMMC_MASKR  = 0;
  _WriteRegDelayed(&SDMMC_POWER, POWER_ON);   // Enable the power to SD card. Take into account the time between the write operations.
  _WriteRegDelayed(&SDMMC_CLKCR, clkcr);
  SDMMC_DTIMER = dtimer;
#if FS_MMC_HW_CM_USE_OS
  //
  // Unmask the interrupt sources and re-enable the interrupt.
  //
  SDMMC_MASKR  = MASK_ALL;
#endif // FS_MMC_HW_CM_USE_OS
}

/*********************************************************************
*
*       _WaitForInactive
*/
static void _WaitForInactive(void) {
  U32 TimeOut;
  U32 Status;

