GregSiGenix/MovingFwdVSCode/emFile/Driver/MMC_CM/Morpheus/FS_MMC_HW_CM_STM32H735_Morpheus.c
  TimeOut = WAIT_TIMEOUT_CYCLES;
  while (1) {
    Status = _GetStatus();
    if (((Status & (1uL << STAR_CPSMACT_BIT)) == 0) &&
        ((Status & (1uL << STAR_DPSMACT_BIT)) == 0) &&
        ((Status & (1uL << STAR_BUSYD0_BIT)) == 0)) {
      break;
    }
    if (--TimeOut == 0) {
      _Reset();
      break;                            // Error, timeout expired.
    }
    if (_WaitForEventIfRequired()) {
      _Reset();
      break;                            // Error, timeout expired.
    }
  }
}

/*********************************************************************
*
*       _WaitEndOfCommand
*/
static int _WaitEndOfCommand(void) {
  int r;
  U32 Status;
  U32 TimeOut;

  //
  // Wait for the command to be sent.
  //
  TimeOut = WAIT_TIMEOUT_CYCLES;
  while (1) {
    Status = _GetStatus();
    if (Status & (1uL << STAR_CMDSENT_BIT)) {
      r = FS_MMC_CARD_NO_ERROR;
      break;
    }
    if (Status & (1uL << STAR_CCRCFAIL_BIT)) {
      r = FS_MMC_CARD_RESPONSE_CRC_ERROR;
      break;
    }
    if (Status & (1uL << STAR_CTIMEOUT_BIT)) {
      r = FS_MMC_CARD_RESPONSE_TIMEOUT;
      break;
    }
    if (--TimeOut == 0) {
      r = FS_MMC_CARD_RESPONSE_TIMEOUT;
      break;                                // Error, timeout expired.
    }
    if (_WaitForEventIfRequired()) {
      r = FS_MMC_CARD_RESPONSE_TIMEOUT;
      break;                                // Error, timeout expired.
    }
  }
  return r;
}

/*********************************************************************
*
*       _WaitEndOfResponse
*/
static int _WaitEndOfResponse(void) {
  int r;
  U32 Status;
  U32 TimeOut;

  //
  // Wait for the response to be received.
  //
  TimeOut = WAIT_TIMEOUT_CYCLES;
  while (1) {
    Status = _GetStatus();
    if (Status & (1uL << STAR_CMDREND_BIT)) {
      r = FS_MMC_CARD_NO_ERROR;
      break;
    }
    if (Status & (1uL << STAR_CCRCFAIL_BIT)) {
      r = FS_MMC_CARD_RESPONSE_CRC_ERROR;
      break;
    }
    if (Status & (1uL << STAR_CTIMEOUT_BIT)) {
      r = FS_MMC_CARD_RESPONSE_TIMEOUT;
      break;
    }
    if (--TimeOut == 0) {
      r = FS_MMC_CARD_RESPONSE_TIMEOUT;     // Error, timeout expired.
      break;
    }
    if (_WaitForEventIfRequired()) {
      r = FS_MMC_CARD_RESPONSE_TIMEOUT;
      break;                                // Error, timeout expired.
    }
  }
  if (r == FS_MMC_CARD_NO_ERROR) {
    //
    // Check and wait for the card to become ready.
    //
    if (_IsR1Busy) {
      Status = SDMMC_STAR;
      if (Status & (1uL << STAR_BUSYD0_BIT)) {
        TimeOut = WAIT_TIMEOUT_CYCLES;
        while (1) {
          Status = _GetStatus();
          if (Status & (1uL << STAR_BUSY0END_BIT)) {
            break;
          }
          if (Status & (1uL << STAR_DTIMEOUT_BIT)) {
            r = FS_MMC_CARD_RESPONSE_TIMEOUT;
            break;
          }
          if (--TimeOut == 0) {
            r = FS_MMC_CARD_RESPONSE_TIMEOUT;
            break;
          }
          if (_WaitForEventIfRequired()) {
            r = FS_MMC_CARD_RESPONSE_TIMEOUT;
            break;                                // Error, timeout expired.
          }
        }
      }
    }
  }
  return r;
}

/*********************************************************************
*
*       _WaitForRxDone
*
*  Function description
*    Waits for the read data transfer to end.
*/
static int _WaitForRxDone(void) {
  int r;
  U32 Status;
  U32 TimeOut;

  TimeOut = WAIT_TIMEOUT_CYCLES;
  while (1) {
    Status = _GetStatus();
    if (Status & (1uL << STAR_DATAEND_BIT)) {
      r = FS_MMC_CARD_NO_ERROR;
      break;
    }
    if (Status & (1uL << STAR_DCRCFAIL_BIT)) {
      r = FS_MMC_CARD_READ_CRC_ERROR;
      break;
    }
    if (Status & (1uL << STAR_DTIMEOUT_BIT)) {
      r = FS_MMC_CARD_READ_TIMEOUT;
      break;
    }
    if (Status & (1uL << STAR_RXOVERR_BIT)) {
      r = FS_MMC_CARD_READ_GENERIC_ERROR;
      break;
    }
    if (--TimeOut == 0) {
      r = FS_MMC_CARD_WRITE_GENERIC_ERROR;
      break;
    }
    if (_WaitForEventIfRequired()) {
      r = FS_MMC_CARD_WRITE_GENERIC_ERROR;
      break;                                // Error, timeout expired.
    }
  }
  return r;
}

/*********************************************************************
*
*       _WaitForRxReady
*
*  Function description
*    Waits for data to be stored in the RX FIFO.
*/
static int _WaitForRxReady(void) {
  int r;
  U32 Status;
  U32 TimeOut;

  TimeOut = WAIT_TIMEOUT_CYCLES;
  while (1) {
    Status = _GetStatus();
    if (Status & (1uL << STAR_RXFIFOF_BIT)) {
      r = FS_MMC_CARD_NO_ERROR;
      break;
    }
    if ((Status & (1uL << STAR_RXFIFOE_BIT)) == 0) {
      r = FS_MMC_CARD_NO_ERROR;
      break;
    }
    if (Status & (1uL << STAR_RXFIFOHF_BIT)) {
      r = FS_MMC_CARD_NO_ERROR;
      break;
    }
    if (Status & (1uL << STAR_DATAEND_BIT)) {
      r = FS_MMC_CARD_NO_ERROR;
      break;
    }
    if (Status & (1uL << STAR_DCRCFAIL_BIT)) {
      r = FS_MMC_CARD_READ_CRC_ERROR;
      break;
    }
    if (Status & (1uL << STAR_DTIMEOUT_BIT)) {
      r = FS_MMC_CARD_READ_TIMEOUT;
      break;
    }
    if (Status & (1uL << STAR_RXOVERR_BIT)) {
      r = FS_MMC_CARD_READ_GENERIC_ERROR;
      break;
    }
    if (--TimeOut == 0) {
      r = FS_MMC_CARD_READ_TIMEOUT;
      break;
    }
    if (_WaitForEventIfRequired()) {
      r = FS_MMC_CARD_READ_TIMEOUT;
      break;                                // Error, timeout expired.
    }
  }
  return r;
}

/*********************************************************************
*
*       _ReadData
*
*  Function description
*    Receives data from SD card using the CPU (i.e. without DMA).
*/
static int _ReadData(void) {
  int   r;
  U32   NumBytes;
  U32   Status;
  U8  * pData8;
  U32   Data32;
  U32 * pData32;

  NumBytes = _BlockSize * _NumBlocks;
  pData8   = (U8 *)_pBuffer;
  while (1) {
    r = _WaitForRxReady();
    if (r) {
      break;
    }
    //
    // Try to read the entire FIFO at once for better performance.
    //
    Status = SDMMC_STAR;
    if (   Status & ((1uL << STAR_RXFIFOF_BIT))
        && (NumBytes >= FIFO_SIZE)
        && (((U32)pData8 & 3) == 0)) {
       pData32 = (U32 *)(void *)pData8;
       *pData32++ = SDMMC_FIFOR;
       *pData32++ = SDMMC_FIFOR;
       *pData32++ = SDMMC_FIFOR;
       *pData32++ = SDMMC_FIFOR;
       *pData32++ = SDMMC_FIFOR;
       *pData32++ = SDMMC_FIFOR;
       *pData32++ = SDMMC_FIFOR;
       *pData32++ = SDMMC_FIFOR;
       *pData32++ = SDMMC_FIFOR;
       *pData32++ = SDMMC_FIFOR;
       *pData32++ = SDMMC_FIFOR;
       *pData32++ = SDMMC_FIFOR;
       *pData32++ = SDMMC_FIFOR;
       *pData32++ = SDMMC_FIFOR;
       *pData32++ = SDMMC_FIFOR;
       *pData32++ = SDMMC_FIFOR;
       NumBytes -= FIFO_SIZE;
       pData8   += FIFO_SIZE;
    } else {
      //
      // Read from FIFO until empty.
      //
      while (1) {
        Status = SDMMC_STAR;
        if (Status & (1uL << STAR_RXFIFOE_BIT)) {
          break;
        }
        Data32 = SDMMC_FIFOR;
        if (NumBytes == 3) {
          *pData8++ = (U8)Data32;
          *pData8++ = (U8)(Data32 >> 8);
          *pData8++ = (U8)(Data32 >> 16);
          NumBytes -= 3;
        } else {
          if (NumBytes == 2) {
            *pData8++ = (U8)Data32;
            *pData8++ = (U8)(Data32 >> 8);
            NumBytes -= 2;
          } else {
            if (NumBytes == 1) {
              *pData8++ = (U8)Data32;
              --NumBytes;
            } else {
              *pData8++ = (U8)Data32;
              *pData8++ = (U8)(Data32 >> 8);
              *pData8++ = (U8)(Data32 >> 16);
              *pData8++ = (U8)(Data32 >> 24);
              NumBytes -= 4;
            }
          }
        }
        if (NumBytes == 0) {
          break;
        }
      }
    }
    if (NumBytes == 0) {
      break;
    }
  }
  if (r == 0) {
    r = _WaitForRxDone();
  }
  return r;
}

/*********************************************************************
*
*       _WaitForTxReady
*
*  Function description
*    Waits for free space in the TX FIFO.
*/
static int _WaitForTxReady(void) {
  int r;
  U32 Status;
  U32 TimeOut;

